going-pro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-21 Sat 03:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Going pro - ethics</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Erlang, TUI, Oldschool code" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Going pro - ethics</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<p>
Programmers like every profession should have a work ethic, even in these trying times
of drip-fed dopamine hits from vibe coding, an ethic should still exist.
</p>

<p>
I've considered ethics and noted down what I think are the core pillars of programmers ethics:
</p>
<div id="outline-container-org6c219b5" class="outline-2">
<h2 id="org6c219b5">Minimise harm.</h2>
<div class="outline-text-2" id="text-org6c219b5">
<p>
"Move fast and break things" is a shitty mindset, I do understand what <a href="https://www.youtube.com/shorts/G2J10urUDw8">Zuckerberg</a> was implying,
however many of us work on systems and tools which can't afford to have the same mindset.  Which
is why i think 'Minimise Harm' is the better mindset.
</p>

<p>
This ethos has faces it presents, as the software fails, as users use the software and its
environmental impact on the world.
</p>
</div>
</div>
<div id="outline-container-org9ac69a5" class="outline-2">
<h2 id="org9ac69a5">Maintain it like your replacement is an axe wielding maniac.</h2>
<div class="outline-text-2" id="text-org9ac69a5">
<p>
Code is read far more often than it is written. Leaving behind a "clever" but unreadable mess is a disservice
to the person who has to fix it at 2:30 AM five years from now.   I find it helpful to consider that this person
may be very angry, and that you should write code that is both clear to understand and corner cases documented
with the "why" answered.
</p>
</div>
</div>
<div id="outline-container-orgcc30133" class="outline-2">
<h2 id="orgcc30133">User privacy.</h2>
<div class="outline-text-2" id="text-orgcc30133">
<p>
This can often be overlooked because of how focused engineers are on the 'pure mechanical side' of software creation.
User information is SO frequently abused that europe implemented  <a href="https://gdpr.eu/what-is-gdpr/">GDPR</a> privacy and security laws because companies have
no morals when it comes to abusing users privacy.
</p>

<p>
As a software developer, privacy abusing user-centric data can appear in many places accidentally, often due to feature
creep or accidental mishandling.  Being aware of the GDPR and your local governance can make discussions with stakeholders
much simpler and prevent these issues before they start.
</p>
</div>
</div>
<div id="outline-container-orgc58b49c" class="outline-2">
<h2 id="orgc58b49c">Social Responsibility/Accessability</h2>
<div class="outline-text-2" id="text-orgc58b49c">
<p>
This is a <code>much</code> harder problem.  <a href="https://www.accessibility.org.au/policy/australian-policy/">Australia</a> has some pretty specific requirements for government websites providing
services to the public, however this isn't applied across the board.  If your project doesn't allow for specifically
catering for disabilities, at least do what you can to ensure that its not created to completely abuse disabled end-users.
</p>
</div>
</div>
<div id="outline-container-org65b24b8" class="outline-2">
<h2 id="org65b24b8">Conclusion</h2>
<div class="outline-text-2" id="text-org65b24b8">
<p>
While the landscape of professional ethics is as broad and complex as the systems we build, these pillars represent what
I see as  the fundamental baseline for responsible software development. There are more nuanced layers to explore,
from the environmental footprint of heavy computational tasks to the unique responsibilities found in security research
and open-source maintenance.
</p>

<p>
Ultimately, technical proficiency is only part of the battle; the rest is ensuring that the code serves as a trustworthy
foundation for everyone who relies on it, and those who maintain it after you are done.
</p>
</div>
</div>
</div>
</body>
</html>
